[
    {
      "course_id": "01",
      "title": "Web development",
      "name": "HTML",
      "price": 245,
      "stock": 20,
      "ratings": 4,
      "ratingsCount": 3972,
      "img": "https://images.pexels.com/photos/11035371/pexels-photo-11035371.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "HTML (HyperText Markup Language) is the most basic building block of the Web. It defines the meaning and structure of web content.Hypertext refers to links that connect web pages to one another, either within a single website or between websites. Links are a fundamental aspect of the Web. By uploading content to the Internet and linking it to pages created by other people, you become an active participant in the World Wide Web.HTML uses markup to annotate text, images, and other content for display in a Web browser. HTML markup includes special elements such as <head>, <title>, <body>, <header>, <footer>, <article>, <section>, <p>, <div>, <span>, <img>, <aside>, <audio>, <canvas>, <datalist>, <details>, <embed>, <nav>, <output>, <progress>, <video>, <ul>, <ol>, <li> and many others.An HTML element is set off from other text in a document by tags, which consist of the element name surrounded by < and >. The name of an element inside a tag is case insensitive. That is, it can be written in uppercase, lowercase, or a mixture. For example, the <title> tag can be written as <Title>, <TITLE>, or in any other way. However, the convention and recommended practice is to write tags in lowercase.",
      "quantity": 0
    },
    {
        "course_id": "01",
        "title": "Web development",
        "name": "CSS",
        "price": 245,
        "stock": 20,
        "ratings": 4,
        "ratingsCount": 3972,
        "img": "https://images.pexels.com/photos/11035386/pexels-photo-11035386.jpeg?auto=compress&cs=tinysrgb&w=600",
        "details": "Cascading Style Sheets (CSS) is a stylesheet language used to describe the presentation of a document written in HTML or XML (including XML dialects such as SVG, MathML or XHTML). CSS describes how elements should be rendered on screen, on paper, in speech, or on other media.CSS is among the core languages of the open web and is standardized across Web browsers according to W3C specifications. Previously, the development of various parts of CSS specification was done synchronously, which allowed the versioning of the latest recommendations. You might have heard about CSS1, CSS2.1, or even CSS3. There will never be a CSS3 or a CSS4; rather, everything is now CSS without a version number.After CSS 2.1, the scope of the specification increased significantly and the progress on different CSS modules started to differ so much, that it became more effective to develop and release recommendations separately per module. Instead of versioning the CSS specification, W3C now periodically takes a snapshot of the latest stable state of the CSS specification and individual modules progress. CSS modules now have version numbers, or levels, such as CSS Color Module Level 5",
        "quantity": 0
      },
      {
        "course_id": "01",
        "title": "Web development",
        "name": "Javasrcipt",
        "price": 245,
        "stock": 20,
        "ratings": 4,
        "ratingsCount": 3972,
        "img": "https://media.istockphoto.com/id/1156837650/photo/javascript-code-computer-language-programming-internet-text-editor-components-display-screen.jpg?s=612x612&w=is&k=20&c=kqofA5ZXiq9Ud2HVcWkbGP-gHV6axxmjQTsSZI0wx0M=",
        "details": "JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions. While it is most well-known as the scripting language for Web pages, many non-browser environments also use it, such as Node.js, Apache CouchDB and Adobe Acrobat. JavaScript is a prototype-based, multi-paradigm, single-threaded, dynamic language, supporting object-oriented, imperative, and declarative (e.g. functional programming) styles. Read more about JavaScript.This section is dedicated to the JavaScript language itself, and not the parts that are specific to Web pages or other host environments. For information about APIs that are specific to Web pages, please see Web APIs and DOM.The standards for JavaScript are the ECMAScript Language Specification (ECMA-262) and the ECMAScript Internationalization API specification (ECMA-402). As soon as one browser implements a feature, we try to document it. This means that cases where some proposals for new ECMAScript features have already been implemented in browsers, documentation and examples in MDN articles may use some of those new features. Most of the time, this happens between the stages 3 and 4, and is usually before the spec is officially published.Do not confuse JavaScript with the Java programming language. Both Java and JavaScript are trademarks or registered trademarks of Oracle in the U.S. and other countries. However, the two programming languages have very different syntax, semantics, and use.",
        "quantity": 0
      },
    {
      "course_id": "02",
      "title": "Computer Science and Programming Specialization",
      "name": "Introducttion to Computer Programming",
      "price": 138,
      "stock": 19,
      "ratings": 3,
      "ratingsCount": 4372,
      "img": "https://images.pexels.com/photos/92904/pexels-photo-92904.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "This MOOC provides you with the foundational skill set required to write computer programs. If you are interested in learning how to write interactive, graphical programs from an introductory level in a real programming language, this is the course for you. You will begin by learning the basics of editing and running programs. Then you will learn how to create 2D graphics using shapes and coordinates. Finally, you will learn how to create interactive graphics that you can control with the mouse. You will even solve a set of interactive puzzles using your coding skills in the Sleuth game which has been created especially for this course. The course uses the Javascript language and the p5.js library.",
      "quantity": 0
    },
    {
        "course_id": "02",
        "title": "Computer Science and Programming Specialization",
        "name": "How Computers Work",
        "price": 138,
        "stock": 19,
        "ratings": 3,
        "ratingsCount": 4372,
        "img": "https://images.pexels.com/photos/669996/pexels-photo-669996.jpeg?auto=compress&cs=tinysrgb&w=600",
        "details": "This MOOC provides you with the foundational skill set required to write computer programs. If you are interested in learning how to write interactive, graphical programs from an introductory level in a real programming language, this is the course for you. You will begin by learning the basics of editing and running programs. Then you will learn how to create 2D graphics using shapes and coordinates. Finally, you will learn how to create interactive graphics that you can control with the mouse. You will even solve a set of interactive puzzles using your coding skills in the Sleuth game which has been created especially for this course. The course uses the Javascript language and the p5.js library.",
        "quantity": 0
      },
      {
        "course_id": "02",
        "title": "Computer Science and Programming Specialization",
        "name": "Mathematics for Computer Science",
        "price": 138,
        "stock": 19,
        "ratings": 3,
        "ratingsCount": 4372,
        "img": "https://images.pexels.com/photos/270348/pexels-photo-270348.jpeg?auto=compress&cs=tinysrgb&w=600",
        "details": "Welcome to Introduction to Numerical Mathematics. This is designed to give you part of the mathematical foundations needed to work in computer science in any of its strands, from business to visual digital arts, music, games. At any stage of the problem solving and modelling stage you will require numerical and computational tools. We get you started in binary and other number bases, some tools to make sense of sequences of numbers, how to represent space numerical using coordinates, how to study variations of quantities via functions and their graphs. For this we prepared computing and everyday life problems for you to solve using these tools, from sending secret messages to designing computer graphics.",
        "quantity": 0
      },
    {
      "course_id": "03",
      "title": "Data Structures and Algorithms Specialization",
      "name": "Algorithm on graphs",
      "price": 260,
      "stock": 4,
      "ratings": 5,
      "ratingsCount": 1976,
      "img": "https://media.istockphoto.com/id/1364317541/photo/data-scientists-hand-of-programmer-touching-and-analyzing-development-at-various-information.jpg?b=1&s=612x612&w=0&k=20&c=H9hX8Ab3ZZYyFcXdnNSRV3kf2LLFtEOGnzgBr3Fl0cQ=",
      "details": "If you have ever used a navigation service to find optimal route and estimate time to destination, you've used algorithms on graphs. Graphs arise in various real-world situations as there are road networks, computer networks and, most recently, social networks! If you're looking for the fastest time to get to work, cheapest way to connect a set of computers into a network or efficient algorithm to automatically find communities and opinion leaders in Facebook, you're going to work with graphs and algorithms on graphs.n this online course, you will first learn what a graph is and what are some of the most important properties. Then you'll learn several ways to traverse graphs and how you can do useful things while traversing the graph in some order.We will then talk about shortest paths algorithms — from the basic ones to those which open door for 1000000 times faster algorithms used in Google Maps and other navigational services",
      "quantity": 0
    },
    {
        "course_id": "03",
        "title": "Data Structures and Algorithms Specialization",
        "name": "Data Structure",
        "price": 260,
        "stock": 4,
        "ratings": 5,
        "ratingsCount": 1976,
        "img": "https://media.istockphoto.com/id/1364317541/photo/data-scientists-hand-of-programmer-touching-and-analyzing-development-at-various-information.jpg?b=1&s=612x612&w=0&k=20&c=H9hX8Ab3ZZYyFcXdnNSRV3kf2LLFtEOGnzgBr3Fl0cQ=",
        "details": "A good algorithm usually comes together with a set of good data structures that allow the algorithm to manipulate the data efficiently. In this online course, we consider the common data structures that are used in various computational problems. You will learn how these data structures are implemented in different programming languages and will practice implementing them in our programming assignments. This will help you to understand what is going on inside a particular built-in implementation of a data structure and what to expect from it. You will also learn typical use cases for these data structures.",
        "quantity": 0
      },
      {
        "course_id": "03",
        "title": "Data Structures and Algorithms Specialization",
        "name": "Algorithm on strings",
        "price": 260,
        "stock": 4,
        "ratings": 5,
        "ratingsCount": 1976,
        "img": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/47/9b91a0dc4511e5a1f32dc2968fca7e/FundamentalofComputing_1024x1024_graphic.jpg?auto=format%2Ccompress%2C%20enhance&dpr=1&w=330&h=330&fit=fill&q=25",
        "details": "World and internet is full of textual information. We search for information using textual queries, we read websites, books, e-mails. All those are strings from the point of view of computer science. To make sense of all that information and make search efficient, search engines use many string algorithms. Moreover, the emerging field of personalized medicine uses many search algorithms to find disease-causing mutations in the human genome. In this online course you will learn key pattern matching concepts: tries, suffix trees, suffix arrays and even the Burrows-Wheeler transform.",
        "quantity": 0
      },
    {
      "course_id": "04",
      "title": "Machine Learning Specialization",
      "name": "Supervised Machine Learning",
      "price": 109,
      "stock": 6,
      "ratings": 5,
      "ratingsCount": 1688,
      "img": "https://images.pexels.com/photos/4578660/pexels-photo-4578660.jpeg?auto=compress&cs=tinysrgb&w=600",
      "details": "Build machine learning models in Python using popular machine learning libraries NumPy and scikit-learn.Build and train supervised machine learning models for prediction and binary classification tasks, including linear regression and logistic regression.The Machine Learning Specialization is a foundational online program created in collaboration between DeepLearning.AI and Stanford Online. In this beginner-friendly program, you will learn the fundamentals of machine learning and how to use these techniques to build real-world AI applications.This Specialization is taught by Andrew Ng, an AI visionary who has led critical research at Stanford University and groundbreaking work at Google Brain, Baidu, and Landing.AI to advance the AI field.By the end of this Specialization, you will have mastered key concepts and gained the practical know-how to quickly and powerfully apply machine learning to challenging real-world problems. If you’re looking to break into AI or build a career in machine learning, the new Machine Learning Specialization is the best place to start.",
      "quantity": 0
    },
    {
        "course_id": "04",
        "title": "Machine Learning Specialization",
        "name": "Advanched Learning Algorithm",
        "price": 109,
        "stock": 6,
        "ratings": 5,
        "ratingsCount": 1688,
        "img": "https://images.pexels.com/photos/2599244/pexels-photo-2599244.jpeg?auto=compress&cs=tinysrgb&w=600",
        "details": "Build machine learning models in Python using popular machine learning libraries NumPy and scikit-learn.Build and train supervised machine learning models for prediction and binary classification tasks, including linear regression and logistic regression.The Machine Learning Specialization is a foundational online program created in collaboration between DeepLearning.AI and Stanford Online. In this beginner-friendly program, you will learn the fundamentals of machine learning and how to use these techniques to build real-world AI applications.This Specialization is taught by Andrew Ng, an AI visionary who has led critical research at Stanford University and groundbreaking work at Google Brain, Baidu, and Landing.AI to advance the AI field.By the end of this Specialization, you will have mastered key concepts and gained the practical know-how to quickly and powerfully apply machine learning to challenging real-world problems. If you’re looking to break into AI or build a career in machine learning, the new Machine Learning Specialization is the best place to start.",
        "quantity": 0
      },
      {
        "course_id": "04",
        "title": "Machine Learning Specialization",
        "name": "Unsupervised Learning",
        "price": 109,
        "stock": 6,
        "ratings": 5,
        "ratingsCount": 1688,
        "img": "https://images.pexels.com/photos/3036405/pexels-photo-3036405.jpeg?auto=compress&cs=tinysrgb&w=600",
        "details": "Use unsupervised learning techniques for unsupervised learning: including clustering and anomaly detection.Build recommender systems with a collaborative filtering approach and a content-based deep learning method.Build a deep reinforcement learning model.The Machine Learning Specialization is a foundational online program created in collaboration between DeepLearning.AI and Stanford Online. In this beginner-friendly program, you will learn the fundamentals of machine learning and how to use these techniques to build real-world AI applications.This Specialization is taught by Andrew Ng, an AI visionary who has led critical research at Stanford University and groundbreaking work at Google Brain, Baidu, and Landing.AI to advance the AI field.This 3-course Specialization is an updated and expanded version of Andrew’s pioneering Machine Learning course, rated 4.9 out of 5 and taken by over 4.8 million learners since it launched in 2012.By the end of this Specialization, you will have mastered key concepts and gained the practical know-how to quickly and powerfully apply machine learning to challenging real-world problems. If you’re looking to break into AI or build a career in machine learning, the new Machine Learning Specialization is the best place to start.",
        "quantity": 0
      }
  ]